# Curve Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaReinforcementCurve..::..Curve Property
AreaReinforcementCurve Class See Also
---
Returns the 3D curve forming part of the boundary of an Area Reinforcement element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Curve Curve { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Curve As Curve
	Get
```

Visual C++
---
```text
public:
property Curve^ Curve {
	Curve^ get ();
}
```

# See Also
AreaReinforcementCurve Class
Autodesk.Revit.DB.Structure Namespace